examples/active_flow_control/env01/system/probes-inCylinder
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
    (0.05 0 0)
    (0.049384417 0.007821723 0)
    (0.047552826 0.01545085 0)
    (0.044550326 0.022699525 0)
    (0.04045085 0.029389263 0)
    (0.035355339 0.035355339 0)
    (0.029389263 0.04045085 0)
    (0.022699525 0.044550326 0)
    (0.01545085 0.047552826 0)
    (0.007821723 0.049384417 0)
    (0 0.05 0)
    (-0.007821723 0.049384417 0)
    (-0.01545085 0.047552826 0)
    (-0.022699525 0.044550326 0)
    (-0.029389263 0.04045085 0)
    (-0.035355339 0.035355339 0)
    (-0.04045085 0.029389263 0)
    (-0.044550326 0.022699525 0)
    (-0.047552826 0.01545085 0)
    (-0.049384417 0.007821723 0)
    (-0.05 0 0)
    (-0.049384417 -0.007821723 0)
    (-0.047552826 -0.01545085 0)
    (-0.044550326 -0.022699525 0)
    (-0.04045085 -0.029389263 0)
    (-0.035355339 -0.035355339 0)
    (-0.029389263 -0.04045085 0)
    (-0.022699525 -0.044550326 0)
    (-0.01545085 -0.047552826 0)
    (-0.007821723 -0.049384417 0)
    (0 -0.05 0)
    (0.007821723 -0.049384417 0)
    (0.01545085 -0.047552826 0)
    (0.022699525 -0.044550326 0)
    (0.029389263 -0.04045085 0)
    (0.035355339 -0.035355339 0)
    (0.04045085 -0.029389263 0)
    (0.044550326 -0.022699525 0)
    (0.047552826 -0.01545085 0)
    (0.049384417 -0.007821723 0)
);

